Core/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерхняяГраницаОстатков</name>
    <comment>Используется в прайс-листе при выводе остатков в виде представления</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.ВидыАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМаркировки</name>
    <type>
      <types>EnumRef.ВидыМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыписыватьГарантийныйТалон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГарантийныйСрок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортнаяАлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключитьИзПрайсЛистов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПартии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерийныеНомера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияНоменклатуры</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМВид</name>
    <type>
      <types>EnumRef.ВидыКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМРазмер</name>
    <type>
      <types>EnumRef.РазмерыКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМСпособВыпускаВОборот</name>
    <type>
      <types>EnumRef.СпособыВыпускаВОборотГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Крепость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодОценки</name>
    <type>
      <types>EnumRef.МетодОценкиЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НижняяГраницаОстатков</name>
    <comment>Используется в прайс-листе при выводе остатков в виде представления</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДАЛ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводительИмпортерАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>РекомендуемЗаказать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Спецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПополнения</name>
    <type>
      <types>EnumRef.СпособыПополненияЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействияФлагаНовинка</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполненияЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПополнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗапасов</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭДГИСМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксированнаяСтоимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <type>
      <types>CatalogRef.ЦеновыеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоНовинка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяНоменклатураВЭД</name>
    <type>
      <types>CatalogRef.КлассификаторТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <comment>Вес брутто (кг)</comment>
    <type>
      <types>DefinedType.Вес</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>DefinedType.Объем</types>
    </type>
  </attributes>
  <attributes>
    <name>Длина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗапасовРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗатратРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Неактивен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаПереработчикуРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентИмпорта</name>
    <type>
      <types>CatalogRef.ПроцентыИмпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесНетто</name>
    <comment>Вес брутто (кг) (Gross Weight)</comment>
    <type>
      <types>DefinedType.Вес</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyНаименованияПоставщиков</name>
    <type>
      <types>CatalogRef.AzRyНаименованияПоставщиков</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyНомерЯчейки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AzRyДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AzRyДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyАвторИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRytmpНоменклатурныеГруппы</name>
    <type>
      <types>CatalogRef.AzRytmpНоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRytmpGUID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПроект</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Запас</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>Операция</name>
  </enumValues>
  <enumValues>
    <name>ВидРабот</name>
  </enumValues>
  <enumValues>
    <name>AzRyРасход</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ВидыМаркировки/ВидыМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыМаркировки</name>
  <enumValues>
    <name>НеМаркируется</name>
  </enumValues>
  <enumValues>
    <name>КонтрольныйИдентификационныйЗнак</name>
  </enumValues>
  <enumValues>
    <name>МаркируемаяПродукция</name>
  </enumValues>
</mdclass:Enum>

Core/src/Catalogs/КатегорииНоменклатуры/КатегорииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КатегорииНоменклатуры</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>БезКатегории</name>
      <description>&lt;Без категории></description>
    </items>
  </predefined>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.ВидыАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортнаяАлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияПоКлассификатору</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойствХарактеристики</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатурыПоУмолчанию</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Catalog>

Core/src/Catalogs/Номенклатура/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда
		
		ПроверяемыеРеквизиты.Добавить("МетодОценки");
		ПроверяемыеРеквизиты.Добавить("НаправлениеДеятельности");
		ПроверяемыеРеквизиты.Добавить("СпособПополнения");
		Если НЕ ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ТекущаяДата()) Тогда 
			ПроверяемыеРеквизиты.Добавить("СчетУчетаЗатрат");
			ПроверяемыеРеквизиты.Добавить("СчетУчетаЗапасов");
		Иначе
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетУчетаЗатрат");
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетУчетаЗапасов");
		КонецЕсли;
		
	ИначеЕсли ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
		
		ПроверяемыеРеквизиты.Добавить("НаправлениеДеятельности");
		Если НЕ ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ТекущаяДата()) Тогда 
			ПроверяемыеРеквизиты.Добавить("СчетУчетаЗатрат");
		Иначе
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетУчетаЗатрат");
		КонецЕсли;
		
	ИначеЕсли ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Работа Тогда
		
		ПроверяемыеРеквизиты.Добавить("НаправлениеДеятельности");
		Если НЕ ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ТекущаяДата()) Тогда
			ПроверяемыеРеквизиты.Добавить("СчетУчетаЗатрат");
		Иначе
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетУчетаЗатрат");
			ПроверяемыеРеквизиты.Добавить("СчетУчетаЗатратРегл");
		КонецЕсли;
		
	ИначеЕсли ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Операция Тогда
		Если НЕ ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ТекущаяДата()) Тогда
			ПроверяемыеРеквизиты.Добавить("СчетУчетаЗатрат");
		Иначе
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетУчетаЗатрат");
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа И НЕ ЗначениеЗаполнено(КатегорияНоменклатуры) Тогда
		КатегорияНоменклатуры = Справочники.КатегорииНоменклатуры.БезКатегории;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения<>Неопределено И ДанныеЗаполнения.Свойство("ЭтоГруппа") И ДанныеЗаполнения.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		НаименованиеПолное = ТекстЗаполнения;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("КатегорияНоменклатуры")
		И ЗначениеЗаполнено(ДанныеЗаполнения.КатегорияНоменклатуры) Тогда
		
		Если ОбщегоНазначения.ОбъектЯвляетсяГруппой(ДанныеЗаполнения.КатегорияНоменклатуры) Тогда
			ДанныеЗаполнения.Удалить("КатегорияНоменклатуры");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка И ДополнительныеСвойства.Свойство("ОтключитьМеханизмРегистрацииОбъектов") Тогда
		Возврат;
	КонецЕсли;
	
	ДатаИзменения = ТекущаяДата();
	
	Если НЕ ЭтоГруппа
		И ПометкаУдаления = Истина Тогда 
		
		ИсключитьИзПрайсЛистов = Истина;
		
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		КатегорииНоменклатурыСервер.ПроверкаЗаполненияСвойствПередЗаписью(ЭтотОбъект, Отказ);
		Если НЕ АлкогольнаяПродукция
			И ЗначениеЗаполнено(ВидАлкогольнойПродукции) Тогда
			АлкогольнаяПродукция = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// для КиЗ и номенклатуры, которая маркируется КиЗ учет сериный номеров обязателен 
	Если НЕ ЭтоГруппа 
		И (ВидМаркировки = Перечисления.ВидыМаркировки.КонтрольныйИдентификационныйЗнак
			ИЛИ ВидМаркировки = Перечисления.ВидыМаркировки.МаркируемаяПродукция ) Тогда
		
		ИспользоватьСерийныеНомера = Истина;
		
	КонецЕсли;
	
	// для маркировки = киз - ставим, что это КИЗ
	Если НЕ ЭтоГруппа Тогда
		КизГИСМ = (ВидМаркировки = Перечисления.ВидыМаркировки.КонтрольныйИдентификационныйЗнак);
		//Паганини_
		Если НЕ ПометкаУдаления И Не РС_ОбщегоНазначения.РеквизитУникален(Ссылка, "Артикул", Артикул, "Номенклатура") Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='არტიკული არ არის უნიკალური.';ru='Артикул не уникален.'"), , , , Отказ);
		КонецЕсли;
		//_Паганини
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если НЕ ОбъектКопирования.ЭтоГруппа Тогда
		
		Спецификация = Неопределено;
		ФайлКартинки = Справочники.НоменклатураПрисоединенныеФайлы.ПустаяСсылка();
		
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка И ДополнительныеСвойства.Свойство("ОтключитьМеханизмРегистрацииОбъектов") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		КатегорииНоменклатурыСервер.ПроверкаЗаполненияСвойствПриЗаписи(ЭтотОбъект, КатегорияНоменклатуры, Отказ);
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры


Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	Конецесли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УзелТовары = ОбменСКассовымСерверомШтрихМПереопределяемый.УзелТовары();
	
	ПланыОбмена.УдалитьРегистрациюИзменений(УзелТовары, Ссылка);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
